<?php  
/*********************************************************************************
 * brophp2.0 分布式数据库架构参考文件，需要复制到和brophp框架目录同级目录下使用  *
 * *******************************************************************************
 * 许可声明：专为《细说PHP》读者及LAMP兄弟连学员提供的“学习型”超轻量级php框架。*
 * *******************************************************************************
 * 版权所有 (C) 2011-2018 北京易第优教育咨询有限公司，并保留所有权利。           *
 * 网站地址: http://www.ydma.cn 【猿代码】                                       *
 * *******************************************************************************
 * $Author: 高洛峰 (g@itxdl.cn) $                                                *
 * $Date: 2015-07-18 10:00:00 $                                                  * 
 * *******************************************************************************/
/*
	define("CHARSET", 'utf8');			     	  //设置数据库的传输字符集， 不开启则继承主配置文件 
//	define("DSN", "mysql:host=localhost;dbname=brophp");	  //如果使用PDO可以使用， 不开启则继承主配置文件  
	define("HOST", "192.168.2.187");		    	  //数据库主机， 不开启则继承主配置文件 
	define("USER", "testuser");                               //数据库用户名， 不开启则继承主配置文件 
	define("PASS", "ydma_cn");                                //数据库密码， 不开启则继承主配置文件 
	define("DBNAME","broshop");			          //数据库名， 不开启则继承主配置文件 
	define("TABPREFIX", "bro_");                              //数据表前缀， 不开启则继承主配置文件 

*/
