<?php
/*********************************************************************************
 * brophp2.0 分布式项目部署参考文件，需要复制到和brophp框架目录同级目录下使用    *
 * *******************************************************************************
 * 许可声明：专为《细说PHP》读者及LAMP兄弟连学员提供的“学习型”超轻量级php框架。*
 * *******************************************************************************
 * 版权所有 (C) 2011-2018 北京易第优教育咨询有限公司，并保留所有权利。           *
 * 网站地址: http://www.ydma.cn 【猿代码】                                       *
 * *******************************************************************************
 * $Author: 高洛峰 (g@itxdl.cn) $                                                *
 * $Date: 2015-07-18 10:00:00 $                                                  * 
 * *******************************************************************************/

/*
	define('B_UP_PATH', './uploads');                                //文件上传的服务器位置， 相对于服务器目结构，  Linux下需要设置可写权限
	define('B_UPW_PATH', 'http://localhost/bro_shop/uploads/');      //运程请求上传的内容， 相对于Web服务器文档根目录
	define('B_UPC_PATH', './thumb/');                      		 //上传的图片， 应用时生成的缓存图片存放路径，  Linux下需要设置可写权限
	define('B_UPCW_PATH', 'http://localhost/bro_shop/thumb/');       //远程请求上传的缓存内容， 相对于Web服务器文档根目录
	define('B_PUBLIC', 'http://192.168.2.187/public');           	 //手动指定公共资源css, js和image的位置
	$b_res_admin = 'http://192.168.2.187/admin';  		   	 //admin应用的页面资源文件存放位置	
	$b_res_home = 'http://192.168.2.188/home';		  	 //home应用的页面资源文件存放位置
      //$b_res_xxx = 'http://192.168.2.189'; 		          	 //XXX应用的页面资源文件存放位置
      //define('B_RUN_PATH', 'D:/test/');				//指定runtime运行时生成的文件位置, Linux下需要设置可写权限

 */
